In [35]:
import numpy as np
import pandas as po
import matplotlib.pyplot as plt
import statsmodels.datasets as dt
import statsmodels.api as sm

C:\Anaconda\lib\site-packages\statsmodels\compat\pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

In [2]:
#Using Pandas in series

In [3]:
s = po.Series(np.random.randn(5),index = ['a','b','c','d','e'])
s

a   -0.824967
b   -0.653276
c   -0.865814
d    0.807699
e    0.394224
dtype: float64

In [4]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
data = {'a':14, 'b':22,'c':5}
data

{'a': 14, 'b': 22, 'c': 5}

In [6]:
po.Series(data)

a    14
b    22
c     5
dtype: int64

In [7]:
po.Series(data,index = ['a','b','c','d','e'])

a    14.0
b    22.0
c     5.0
d     NaN
e     NaN
dtype: float64

In [8]:
po.Series(5., index = ['a','b','c','d','e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [9]:
string = "Hello"
if 'p' in string:
    print('Available')
else:
    print('Not Available')

Not Available

In [10]:
s+np.exp(s) #add the rows to the exponent of the same row

a   -0.386717
b   -0.132937
c   -0.445105
d    3.050440
e    1.877457
dtype: float64

In [11]:
s[1:]+s[:-1]

a         NaN
b   -1.306551
c   -1.731627
d    1.615398
e         NaN
dtype: float64

In [12]:
s1 = po.Series(np.random.randn(5),name = "Something")

In [13]:
s2 = s1.rename("Anything")
s2

0   -1.939376
1   -0.120103
2   -0.228894
3    2.339530
4   -0.581776
Name: Anything, dtype: float64

In [15]:
data = [{'a':17,'b':20,'d':12},{'a':3,'c':23,'d':33}]
po.DataFrame(data)

    a     b     c   d
0  17  20.0   NaN  12
1   3   NaN  23.0  33

In [18]:
po.DataFrame(data,index = ['001','002']) #Name the index

      a     b     c   d
001  17  20.0   NaN  12
002   3   NaN  23.0  33

In [21]:
Data2 = po.DataFrame(data,columns = ['a','b'])
Data2

    a     b
0  17  20.0
1   3   NaN

In [24]:
po.DataFrame(data)

    a     b     c   d
0  17  20.0   NaN  12
1   3   NaN  23.0  33

In [28]:
Data3 = po.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])
Data3

   A  B
0  1  4
1  2  5
2  3  6

In [60]:
import_raw = po.read_csv('C:/Users/C248129/Desktop/Female.csv')
import_raw.head()

,PRTAGE,PERACE,PESEX,PEERNLAB,Education,Female,Female*Education,Wage
0,36,1,2,2,13.0,1,13.0,0.13
1,47,1,1,1,12.0,0,0.0,0.50
2,33,1,1,2,8.0,0,0.0,0.89
3,51,5,2,2,12.0,1,12.0,1.00
4,16,1,2,2,11.0,1,11.0,1.00

In [62]:
#craete a conditional column
import_change = po.DataFrame(import_raw)
import_change['Male'] = np.where(import_raw['Female']==1, 0,1)
import_change.Male

In [63]:
import_change.head()

,PRTAGE,PERACE,PESEX,PEERNLAB,Education,Female,Female*Education,Wage,Male
0,36,1,2,2,13.0,1,13.0,0.13,0
1,47,1,1,1,12.0,0,0.0,0.50,1
2,33,1,1,2,8.0,0,0.0,0.89,1
3,51,5,2,2,12.0,1,12.0,1.00,0
4,16,1,2,2,11.0,1,11.0,1.00,0

In [65]:
#create a calculated column
import_change2 = import_change.assign(Male_Education = import_change['Male'] * import_change['Education'])
import_change2.head()

,PRTAGE,PERACE,PESEX,PEERNLAB,Education,Female,Female*Education,Wage,Male,Male_Education
0,36,1,2,2,13.0,1,13.0,0.13,0,0.0
1,47,1,1,1,12.0,0,0.0,0.50,1,12.0
2,33,1,1,2,8.0,0,0.0,0.89,1,8.0
3,51,5,2,2,12.0,1,12.0,1.00,0,0.0
4,16,1,2,2,11.0,1,11.0,1.00,0,0.0

In [74]:
import_change2.iloc[4]
import_change2.loc[0]

PRTAGE              36.00
PERACE               1.00
PESEX                2.00
PEERNLAB             2.00
Education           13.00
Female               1.00
Female*Education    13.00
Wage                 0.13
Male                 0.00
Male_Education       0.00
Name: 0, dtype: float64

In [91]:
index = po.date_range('1/1/2000', periods = 10)
DF = po.DataFrame(np.random.randn(10,3), index = index, columns = list('ABC'))
DF

                   A         B         C
2000-01-01 -0.619453 -0.001474 -0.522526
2000-01-02 -0.468101 -2.245912 -0.537772
2000-01-03  1.359828  0.693577 -2.130972
2000-01-04  0.806751 -0.987926  1.229058
2000-01-05  0.380518  1.623151 -0.310323
2000-01-06  0.493006  0.762103 -0.689035
2000-01-07  1.225518 -1.036239 -0.616640
2000-01-08 -0.568647 -0.944156  0.462139
2000-01-09  0.061722  0.822595  0.992137
2000-01-10  0.988543 -1.990285  0.814475

In [92]:
#Take first 5 rows and transpose it
DF[:5].T

   2000-01-01  2000-01-02  2000-01-03  2000-01-04  2000-01-05
A   -0.619453   -0.468101    1.359828    0.806751    0.380518
B   -0.001474   -2.245912    0.693577   -0.987926    1.623151
C   -0.522526   -0.537772   -2.130972    1.229058   -0.310323

In [100]:
#Sorting a data
DF.sort_values(by = ['B','C'], ascending = False)

                   A         B         C
2000-01-05  0.380518  1.623151 -0.310323
2000-01-09  0.061722  0.822595  0.992137
2000-01-06  0.493006  0.762103 -0.689035
2000-01-03  1.359828  0.693577 -2.130972
2000-01-01 -0.619453 -0.001474 -0.522526
2000-01-08 -0.568647 -0.944156  0.462139
2000-01-04  0.806751 -0.987926  1.229058
2000-01-07  1.225518 -1.036239 -0.616640
2000-01-10  0.988543 -1.990285  0.814475
2000-01-02 -0.468101 -2.245912 -0.537772